package ch11.moduleQ;

public class QModule {
/*
1. API 도큐먼트에 대한 설명으로 틀린 것은 무엇입니까? 4
	➊ 자바 표준 라이브러리를 프로그램에서 어떻게 사용할 수 있는지를 설명하고 있다.
	➋ 클래스의 상속 관계 및 자식 클래스들이 무엇이 있는지 알 수 있다.
	➌ 생성자 선언부, 필드의 타입, 메소드의 선언부를 확인할 수 있다.
	➍ public, protected, default, private 접근 제한을 가지는 멤버들을 확인할 수 있다.

3. Object 클래스에 대한 설명 중 틀린 것은 무엇입니까?  2 
	➊ 모든 자바 클래스의 최상위 부모 클래스이다.
	➋ Object의 equals ( ) 메소드는 == 연산자와 동일하게 번지를 비교한다.
	➌ Object의 hashCode( ) 메소드는 동등 비교 시 활용된다.
	➍ Object의 toString ( ) 메소드는 객체의 필드값을 문자열로 리턴한다.



13. Math 클래스가 제공하는 메소드의 리턴값이 잘못된 것은 무엇입니까? 4
	➊ Math.ceil (5.3)  6.0          ceil = 올림
	➋ Math.floor (5.3)  5.0			floor = 버림
	➌ Math.max(5.3, 2.5)  5.3		max = 최댓값
	➍ Math.round(5.7)  6.0			round = 반올림하지만 가장 가까운 "정수" 값으로 출력함. => 6



16. SimpleDateFormat 클래스를 이용해서 오늘 날짜를 다음과 같이 출력하도록 코드를 작성해 보세요.
xxxx년 xx월 xx일 x요일 xx시 xx 분


18. Class 객체에 대한 설명 중 틀린 것은 무엇입니까?
	➊ Class.forName( ) 메소드 또는 객체의 getClass ( ) 메소드로 얻을 수 있다.
	➋ 패키지와 클래스 이름을 알 수 있다.
	➌ 클래스의 생성자, 필드, 메소드에 대한 정보를 알아낼 수 있다.
	➍ getResource ( ) 메소드는 프로젝트 경로를 기준으로 리소스의 URL을 리턴한다.

19. 어노테이션(Annotation)에 대한 설명 중 틀린 것은 무엇입니까? 
	➊ 컴파일하거나 실행할 때 어떻게 처리해야 할 것인지를 알려주는 역할을 한다.
	➋ 클래스, 필드, 생성자, 메소드를 선언하기 전에 @어노테이션을 붙일 수 있다.
	➌ @어노테이션(“*”)일 경우 value 속성값이 *가 된다.
	➍ @어노테이션(“*”, prop=3)일 경우 value 속성값은 *, prop 속성값은 3이 된다.

 */
	
	
	
}
